export default {
  projections: {
    ЧекE: {
      номер: {
        __caption__: 'Номер чека'
      },
      заправкаАвто: {
        __caption__: 'Количество топлива',
        колТоп: {
          __caption__: 'Количество топлива'
        },
        заправБак: {
          __caption__: '',
          типТопл: {
            __caption__: 'Тип топлива'
          },
          цена: {
            __caption__: 'Цена'
          }
        }
      },
      клиент: {
        __caption__: 'Карта лояльности',
        картаЛояль: {
          __caption__: '',
          ном: {
            __caption__: 'Карта лояльности'
          },
          процСкид: {
            __caption__: 'Процент скидки'
          }
        }
      },
      сумма: {
        __caption__: 'Сумма чека'
      },
      тЧТовары: {
        __caption__: 'Товары',
        товарыСпр: {
          __caption__: 'Товар',
          наим: {
            __caption__: 'Товар'
          },
          цена: {
            __caption__: 'Цена'
          }
        },
        количество: {
          __caption__: 'Количество'
        }
      }
    },
    ЧекL: {
      номер: {
        __caption__: 'Номер чека'
      },
      заправкаАвто: {
        __caption__: 'Количество топлива',
        колТоп: {
          __caption__: 'Количество топлива'
        },
        заправБак: {
          __caption__: '',
          типТопл: {
            __caption__: 'Тип топлива'
          },
          цена: {
            __caption__: 'Цена'
          }
        }
      },
      клиент: {
        __caption__: 'Карта лояльности',
        картаЛояль: {
          __caption__: '',
          ном: {
            __caption__: 'Карта лояльности'
          },
          процСкид: {
            __caption__: 'Процент скидки'
          }
        }
      },
      сумма: {
        __caption__: 'Сумма чека'
      }
    }
  },
  validations: {
    номер: {
      __caption__: 'Номер чека'
    },
    сумма: {
      __caption__: 'Сумма чека'
    },
    заправкаАвто: {
      __caption__: 'Количество топлива'
    },
    клиент: {
      __caption__: 'Карта лояльности'
    },
    тЧТовары: {
      __caption__: 'Товары'
    }
  }
};
