export default {
  projections: {
    КлиентE: {
      наимен: {
        __caption__: 'ФИО'
      },
      номТел: {
        __caption__: 'Номер телефона'
      },
      eMail: {
        __caption__: 'EMail'
      },
      датаРожд: {
        __caption__: 'Дата рождения'
      },
      банкДан: {
        __caption__: 'Банковская карта',
        номКарт: {
          __caption__: 'Банковская карта'
        }
      },
      картаЛояль: {
        __caption__: 'Карта лояльности',
        ном: {
          __caption__: 'Карта лояльности'
        }
      }
    },
    КлиентL: {
      наимен: {
        __caption__: 'ФИО'
      },
      номТел: {
        __caption__: 'Номер телефона'
      },
      eMail: {
        __caption__: 'EMail'
      },
      датаРожд: {
        __caption__: 'Дата рождения'
      },
      банкДан: {
        __caption__: 'Банковская карта',
        номКарт: {
          __caption__: 'Банковская карта'
        }
      },
      картаЛояль: {
        __caption__: 'Карта лояльности',
        ном: {
          __caption__: 'Карта лояльности'
        }
      }
    }
  },
  validations: {
    eMail: {
      __caption__: 'EMail'
    },
    датаРожд: {
      __caption__: 'Дата рождения'
    },
    наимен: {
      __caption__: 'ФИО'
    },
    номТел: {
      __caption__: 'Номер телефона'
    },
    банкДан: {
      __caption__: 'Банковская карта'
    },
    картаЛояль: {
      __caption__: 'Карта лояльности'
    }
  }
};
