export default {
  projections: {
    ЗаправкаАвтоE: {
      номКол: {
        __caption__: 'Номер колонки'
      },
      номШл: {
        __caption__: 'Номер шланга'
      },
      заправБак: {
        __caption__: 'Тип топлива',
        типТопл: {
          __caption__: 'Тип топлива'
        },
        цена: {
          __caption__: 'Цена'
        }
      },
      колТоп: {
        __caption__: 'Количество топлива'
      }
    },
    ЗаправкаАвтоL: {
      номКол: {
        __caption__: 'Номер колонки'
      },
      номШл: {
        __caption__: 'Номер шланга'
      },
      заправБак: {
        __caption__: 'Тип топлива',
        типТопл: {
          __caption__: 'Тип топлива'
        },
        цена: {
          __caption__: 'Цена'
        }
      },
      колТоп: {
        __caption__: 'Количество топлива'
      }
    }
  },
  validations: {
    колТоп: {
      __caption__: 'Количество топлива'
    },
    номКол: {
      __caption__: 'Номер колонки'
    },
    номШл: {
      __caption__: 'Номер шланга'
    },
    заправБак: {
      __caption__: 'Тип топлива'
    }
  }
};
